Revit 2024 API
ElectricalSystem.HasCustomCircuitPath Property
 Checks whether the electrical system circuit path has been customized. If not, the property CircuitPathMode cannot be set as Custom explicitly.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool HasCustomCircuitPath { get; }
Visual Basic
Public ReadOnly Property HasCustomCircuitPath As Boolean
	Get
Visual C++
public:
property bool HasCustomCircuitPath {
	bool get ();
}
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace